nxp-mcuxpresso/mcux-sdk/components/internal_flash/mimxrt1160/fsl_adapter_flexspi_nor_flash.c
    return (hal_flash_status_t)status;
}

/*!
 * \brief  Write data to FLASH
 *
 * @param dest        The address of the Flash location
 * @param size        The number of bytes to be programed
 * @param pData       Pointer to the data to be programmed to Flash
 *
 * @retval #kStatus_HAL_Flash_Success API was executed successfully.
 *
 */
hal_flash_status_t HAL_FlashProgramUnaligned(uint32_t dest, uint32_t size, uint8_t *pData)
{
    return HAL_FlashProgram(dest, size, pData);
}

/*!
 * \brief  Erase to 0xFF one or more FLASH sectors.
 *
 * @param dest            The start address of the first sector to be erased
 * @param size            The amount of flash to be erased (multiple of sector size)
 *
 * @retval #kStatus_HAL_Flash_Success API was executed successfully.
 *
 */
hal_flash_status_t HAL_FlashEraseSector(uint32_t dest, uint32_t size)
{
    FLEXSPI_Type *base;
    uint32_t address;
    status_t status = (status_t)kStatus_HAL_Flash_Error;
    flexspi_transfer_t flashXfer;
    uint32_t key;
#if defined(FSL_FEATURE_SOC_LMEM_COUNT) && (FSL_FEATURE_SOC_LMEM_COUNT == 1U)
    bool CodeCacheEnableFlag = false;
#endif /* FSL_FEATURE_SOC_LMEM_COUNT */

    if (dest < FLEXSPI_AMBA_BASE)
    {
        return kStatus_HAL_Flash_Fail;
    }
#if defined(__ICACHE_PRESENT) && (__ICACHE_PRESENT == 1U)
    bool ICacheEnableFlag = false;
    /* Disable I cache. */
    if (SCB_CCR_IC_Msk == (SCB_CCR_IC_Msk & SCB->CCR))
    {
        SCB_DisableICache();
        ICacheEnableFlag = true;
    }
#endif /* __ICACHE_PRESENT */

#if defined(FSL_FEATURE_SOC_LMEM_COUNT) && (FSL_FEATURE_SOC_LMEM_COUNT == 1U)
    /* Disable Code cache. */
    if (LMEM_PCCCR_ENCACHE_MASK == (LMEM->PCCCR & LMEM_PCCCR_ENCACHE_MASK))
    {
        L1CACHE_DisableCodeCache();
        CodeCacheEnableFlag = true;
    }
#endif /* FSL_FEATURE_SOC_LMEM_COUNT */

    dest = dest - FLEXSPI_AMBA_BASE;
    base = NULL;
    for (uint8_t i = 0; i < (sizeof(s_flexspiBase) / sizeof(FLEXSPI_Type *)); i++)
    {
        if (NULL != s_flexspiBase[i])
        {
            base = s_flexspiBase[i];
            break;
        }
    }
    if (NULL == base)
    {
        return kStatus_HAL_Flash_Fail;
    }

    address = dest;
    while (address < (dest + size))
    {
        /* Write enable */
        status = flexspi_nor_write_enable(base, 0);

        if (status != kStatus_Success)
        {
            break;
        }

        flashXfer.deviceAddress = address;
        flashXfer.port          = kFLEXSPI_PortA1;
        flashXfer.cmdType       = kFLEXSPI_Command;
        flashXfer.SeqNumber     = 1;
        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_ERASESECTOR;

        key    = DisableGlobalIRQ();
        status = FLEXSPI_TransferBlocking(base, &flashXfer);

        if (status != kStatus_Success)
        {
            EnableGlobalIRQ(key);
            break;
        }

        status = flexspi_nor_wait_bus_busy(base);

        address += SECTOR_SIZE;

        /* Do software reset. */
        FLEXSPI_SoftwareReset(base);
        SDK_DelayAtLeastUs(2U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
        EnableGlobalIRQ(key);
    }
    if (status != kStatus_Success)
    {
        key = DisableGlobalIRQ();
        /* Do software reset. */
        FLEXSPI_SoftwareReset(base);
        SDK_DelayAtLeastUs(2U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
        EnableGlobalIRQ(key);
    }
#if defined(__ICACHE_PRESENT) && (__ICACHE_PRESENT == 1U)
    if (ICacheEnableFlag)
    {
        /* Enable I cache. */
        SCB_EnableICache();
    }
#endif /* __ICACHE_PRESENT */

#if defined(FSL_FEATURE_SOC_LMEM_COUNT) && (FSL_FEATURE_SOC_LMEM_COUNT == 1U)
    if (CodeCacheEnableFlag)
    {
        /* Enable Code cache. */
        L1CACHE_EnableCodeCache();
    }
#endif /* FSL_FEATURE_SOC_LMEM_COUNT */

    return (hal_flash_status_t)status;
}

/*!
 * \brief  Read data from FLASH
 *
 *
 * @param scr             The address of the Flash location to be read
 * @param size            The number of bytes to be read
 * @param pData           Pointer to the data to be read from Flash
 *
 * @retval #kStatus_HAL_Flash_Success API was executed successfully.
 *
 */
hal_flash_status_t HAL_FlashRead(uint32_t src, uint32_t size, uint8_t *pData)
{
    FLEXSPI_Type *base;
    hal_flash_status_t status = kStatus_HAL_Flash_Success;
    flexspi_transfer_t flashXfer;
    uint32_t readAddress = src;
    uint32_t key;
#if defined(FSL_FEATURE_SOC_LMEM_COUNT) && (FSL_FEATURE_SOC_LMEM_COUNT == 1U)
    bool CodeCacheEnableFlag = false;
#endif /* FSL_FEATURE_SOC_LMEM_COUNT */

    if (readAddress < FLEXSPI_AMBA_BASE)
    {
        status = kStatus_HAL_Flash_InvalidArgument;
    }

    if (kStatus_HAL_Flash_Success == status)
    {
        if ((0UL != ((uint32_t)((uint32_t)size % 4UL))) || (0UL != ((uint32_t)(((uint32_t)pData) % 4UL))))
        {
            status = kStatus_HAL_Flash_InvalidArgument;
        }
    }

    if (kStatus_HAL_Flash_Success == status)
    {
        readAddress = readAddress - FLEXSPI_AMBA_BASE;

        base = NULL;
        for (uint8_t i = 0; i < (sizeof(s_flexspiBase) / sizeof(FLEXSPI_Type *)); i++)
        {
            if (NULL != s_flexspiBase[i])
            {
                base = s_flexspiBase[i];
                break;
            }
        }
        if (NULL == base)
        {
            status = kStatus_HAL_Flash_Fail;
        }
    }

    if (kStatus_HAL_Flash_Success == status)
    {
#if defined(__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
        bool DCacheEnableFlag = false;
        /* Disable D cache. */
        if (SCB_CCR_DC_Msk == (SCB_CCR_DC_Msk & SCB->CCR))
        {
            SCB_DisableDCache();
            DCacheEnableFlag = true;
        }
#endif /* __DCACHE_PRESENT */

#if defined(FSL_FEATURE_SOC_LMEM_COUNT) && (FSL_FEATURE_SOC_LMEM_COUNT == 1U)
        /* Disable Code cache. */
        if (LMEM_PCCCR_ENCACHE_MASK == (LMEM->PCCCR & LMEM_PCCCR_ENCACHE_MASK))
        {
            L1CACHE_DisableCodeCache();
            CodeCacheEnableFlag = true;
        }
#endif /* FSL_FEATURE_SOC_LMEM_COUNT */

        /* Read page. */
        flashXfer.deviceAddress = readAddress;
        flashXfer.port          = kFLEXSPI_PortA1;
        flashXfer.cmdType       = kFLEXSPI_Read;
        flashXfer.SeqNumber     = 1;
        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READ_FAST_QUAD;
        flashXfer.data          = (uint32_t *)((void *)(&pData[0]));
        flashXfer.dataSize      = size;

